# Importing libraries and loading Datasets

In [29]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/data-science-salary-2021-to-2023/Data Science Salary 2021 to 2023.csv
/kaggle/input/the-global-ai-ml-data-science-salary-for-2025/salaries.csv
/kaggle/input/data-science-salaries-2023/ds_salaries.csv
/kaggle/input/data-science-salaries-2025/salaries.csv
/kaggle/input/datascience-salaries-2024/DataScience_salaries_2024.csv

In [30]:
# Import necessary libraries
import numpy as np  # Import NumPy for handling numerical operations
import pandas as pd  # Import Pandas for data manipulation and analysis
import warnings  # Import Warnings to suppress unnecessary warnings

# Suppress warning messages
warnings.filterwarnings("ignore")

# Import matplotlib for data visualization
import matplotlib.pyplot as plt

In [31]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df1 = pd.read_csv("/kaggle/input/data-science-salaries-2025/salaries.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df1 = df1.dropna()
df1['work_year'] = df1['work_year'].astype(int)
df1 = df1[df1['work_year']>=YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df1.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df1.sample(5)

(105434, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
63801,2024,SE,FT,Research Scientist,142500,USD,142500,US,0,US,M
16267,2025,SE,FT,Consultant,84000,USD,84000,US,0,US,M
53139,2024,MI,FT,Associate,175000,USD,175000,US,0,US,M
98849,2023,SE,FT,Data Engineer,284310,USD,284310,US,0,US,M
81870,2024,MI,FT,Software Engineer,176386,USD,176386,US,0,US,M

In [32]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df2 = pd.read_csv("/kaggle/input/the-global-ai-ml-data-science-salary-for-2025/salaries.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df2 = df2.dropna()
df2['work_year'] = df2['work_year'].astype(int)
df2 = df2[df2['work_year']>=YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df2.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df2.sample(5)

(88584, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
19307,2024,MI,FT,Data Scientist,250000,USD,250000,US,0,US,M
3312,2025,SE,FT,Manager,202500,USD,202500,US,0,US,M
64175,2024,MI,PT,Data Operations Specialist,57000,USD,57000,US,100,US,M
52748,2024,SE,FT,Engineer,235000,USD,235000,US,100,US,M
68403,2024,SE,FT,Data Engineer,95000,USD,95000,US,100,US,M

In [33]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df3 = pd.read_csv("/kaggle/input/datascience-salaries-2024/DataScience_salaries_2024.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df3 = df3[df3['work_year']>= YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df3.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df3.sample(5)

(14838, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
5949,2024,SE,FT,Research Scientist,159300,USD,159300,US,0,US,M
8724,2023,MI,FT,Data Engineer,130000,USD,130000,US,0,US,M
8845,2022,SE,FT,BI Developer,130000,USD,130000,US,100,US,L
12133,2023,MI,FT,Computer Vision Engineer,90000,GBP,110736,GB,100,GB,M
1646,2023,SE,FT,Data Engineer,232960,USD,232960,US,0,US,M

In [34]:
#  Read the CSV file containing job salaries data into a Pandas DataFrame
df4 = pd.read_csv("/kaggle/input/data-science-salary-2021-to-2023/Data Science Salary 2021 to 2023.csv")

# Filter the DataFrame to include only rows where the 'work_year' is greater than or equal to YEAR_TO_START
df4 = df4[df4['work_year']>=YEAR_TO_START]

# Print the shape of the DataFrame to show the number of rows and columns
print(df4.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df4.sample(5)

# No employee residence and remote ratio columns here, skipping

(3761, 9)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,company_location,company_size
1732,2023,SE,FT,Data Engineer,138750,USD,138750,US,M
2622,2022,SE,FT,Data Scientist,168000,USD,168000,US,M
1911,2022,EN,FT,Computer Vision Engineer,125000,USD,125000,US,M
1177,2023,SE,FT,Data Science Manager,150000,USD,150000,MX,M
2407,2022,SE,FT,Data Analyst,115934,USD,115934,US,M

In [35]:
# Read the CSV file containing data on data science salaries for 2023 into a DataFrame
df5 = pd.read_csv("/kaggle/input/data-science-salaries-2023/ds_salaries.csv").drop_duplicates()

# Filter the DataFrame to include only entries from the year YEAR_TO_START and later
df5 = df5[df5['work_year'] >= YEAR_TO_START]

# Print the shape of the filtered DataFrame to show the number of rows and columns
print(df5.shape)

# Display a random sample of 5 rows from the filtered DataFrame.
df5.sample(5)

(2584, 11)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1147,2023,MI,FT,Data Analyst,80000,USD,80000,US,0,US,M
1991,2022,SE,FT,Data Scientist,136000,USD,136000,US,100,US,M
2309,2022,MI,FT,Data Engineer,65000,USD,65000,US,0,US,M
86,2023,SE,FT,Business Intelligence Engineer,129300,USD,129300,US,0,US,M
424,2023,SE,FT,Data Engineer,75000,USD,75000,US,0,US,M

## Concatenating DataFrames vertically

In [36]:
# This combines the rows of the DataFrames to create a new DataFrame
df = pd.concat([df1, df2, df3, df4, df5])

# Replace 'ML Engineer' with 'Machine Learning Engineer' in the 'job_title' column
df['job_title'].replace('ML Engineer', 'Machine Learning Engineer', inplace=True)

# Rename 'experience_level' based on a dictionary mapping
exp_dict = {'EN': 'Entry-level / Junior', 'MI': 'Mid-level / Intermediate', 'SE': 'Senior-level / Expert', 'EX': 'Executive-level / Director'}
df['experience_level'] = df['experience_level'].replace(exp_dict)

# Rename 'employment_type' based on a dictionary mapping
empl_dict = {'PT': 'Part-time', 'FT': 'Full-time', 'CT': 'Contract', 'FL': 'Freelance'}
df['employment_type'] = df['employment_type'].replace(empl_dict)

# Rename 'remote_ratio' based on a dictionary mapping
remote_dict = {0: 'No remote work (less than 20%)', 50: 'Partially remote', 100: 'Fully remote (more than 80%)'}
df['remote_ratio'] = df['remote_ratio'].replace(remote_dict)

# Rename 'company_size' based on a dictionary mapping
company_dict = {'S': 'Small', 'M': 'Medium', 'L': 'Large'}
df['company_size'] = df['company_size'].replace(company_dict)

# Removing duplicate rows from the concatenated DataFrame
# This helps ensure that each row is unique in the final DataFrame
df = df.drop_duplicates()

# Printing the shape of the resulting DataFrame
# This provides information about the number of rows and columns in the DataFrame
print(df.shape)

(55446, 11)

In [37]:
df["work_year"].value_counts()

work_year
2024    27870
2025    18813
2023     5913
2022     2213
2021      477
2020      160
Name: count, dtype: int64

# Data Visualization